cf_billing/InformationRegisters/энргИдентификаторыМКДГИСЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргИдентификаторыМКДГИСЖКХ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторДомаФИАС</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УникальныйНомерДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргИдентификаторыМКДГИСЖКХ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьСхемуИдентификаторыМКД(Схема,ПараметрыСхемы,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаЗаполнитьСхемуИдентификаторыМКД());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
		
	Если ПараметрыСхемы.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "МКД";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор, "ИдентификаторыМКДГИСЖКХ", ПараметрыСхемы.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗаполнитьСхемуИдентификаторыМКД()
	
	Текст =
	"ВЫБРАТЬ
	|	ИдентификаторыМКДГИСЖКХ.МКД КАК Строение,
	|	ИдентификаторыМКДГИСЖКХ.ИдентификаторДомаФИАС КАК ИдентификаторДомаФИАС,
	|	ИдентификаторыМКДГИСЖКХ.ОКТМО КАК ОКТМО
	|ИЗ
	|	РегистрСведений.энргИдентификаторыМКДГИСЖКХ КАК ИдентификаторыМКДГИСЖКХ";
	
	Возврат Текст;
	
КонецФункции 

#КонецОбласти

#КонецЕсли
